Repository: HarunMercan1/Wallet_Elite
Catalog: lib/l10n/app_*.arb
Languages: pl, th

# appName
source: Wallet Elite
pl: Portfel Elita
th: กระเป๋าเงิน อีลิท

source: Cancel
pl: Anuluj
th: ยกเลิก

source: Save
pl: Zapisz
th: บันทึก

source: Saved
pl: Zapisano
th: บันทึกแล้ว

source: Delete
pl: Usu
th: ลบ

source: Edit
pl: Edytuj
th: แก้ไข

source: Add
pl: Dodaj
th: เพิ่ม

source: OK
th: ตกลง

source: Error
pl: Bd
th: ข้อผิดพลาด

source: Success
pl: Sukces
th: สำเร็จ

source: Loading...
pl: adowanie...
th: กำลังโหลด...

source: Search...
pl: Szukaj...
th: ค้นหา...

source: All
pl: Wszystko
th: ทั้งหมด

source: Today
pl: Dzi
th: วันนี้

source: Yesterday
pl: Wczoraj
th: เมื่อวาน

source: not found
pl: nie znaleziono
th: ไม่พบ

source: Home
pl: Start
th: หน้าหลัก

source: Transactions
pl: Transakcje
th: รายการ

source: Statistics
pl: Statystyki
th: สถิติ

source: Settings
pl: Ustawienia
th: ตั้งค่า

source: Welcome,
pl: Witaj,
th: ยินดีต้อนรับ,

source: Total Balance
pl: czne saldo
th: ยอดคงเหลือ

source: Recent Transactions
pl: Ostatnie transakcje
th: รายการล่าสุด

# noTransactions
source: No transactions yet
pl: Brak transakcji
th: ยังไม่มีรายการ

# addFirstTransaction
source: Tap + to add your first!
pl: Dotknij +, aby doda pierwsz!
th: แตะ + เพื่อเพิ่มรายการแรก!

source: Income
pl: Przychód
th: รายรับ

source: Expense
pl: Wydatek
th: รายจ่าย

source: Amount
pl: Kwota
th: จำนวนเงิน

source: Category
pl: Kategoria
th: หมวดหมู่

source: Note
pl: Notatka
th: หมายเหตุ

source: Date
pl: Data
th: วันที่

source: Wallet
pl: Portfel
th: กระเป๋าเงิน

source: Add Transaction
pl: Dodaj transakcj
th: เพิ่มรายการ

source: Edit Transaction
pl: Edytuj transakcj
th: แก้ไขรายการ

source: Delete Transaction
pl: Usu transakcj
th: ลบรายการ

source: Transaction added
pl: Transakcja dodana
th: เพิ่มรายการแล้ว

source: Transaction updated
pl: Transakcja zaktualizowana
th: อัปเดตรายการแล้ว

source: Transaction deleted
pl: Transakcja usunita
th: ลบรายการแล้ว

source: Enter amount
pl: Wprowadź kwot
th: ป้อนจำนวนเงิน

source: Select wallet
pl: Wybierz portfel
th: เลือกกระเป๋าเงิน

source: Add note...
pl: Dodaj notatk...
th: เพิ่มหมายเหตุ...

source: More
pl: Wicej
th: เพิ่มเติม

source: Search transactions...
pl: Szukaj transakcji...
th: ค้นหารายการ...

source: No income found
pl: Nie znaleziono przychodów
th: ไม่พบรายรับ

source: No expense found
pl: Nie znaleziono wydatków
th: ไม่พบรายจ่าย

# confirmDelete
source: Are you sure you want to delete this transaction? This cannot be undone.
pl: Czy na pewno chcesz usun t transakcj? Tej operacji nie można cofn.
th: คุณแน่ใจหรือว่าต้องการลบรายการนี้? ไม่สามารถเลิกทำได้

source: Categories
pl: Kategorie
th: หมวดหมู่

source: Income Categories
pl: Kategorie przychodów
th: หมวดหมู่รายรับ

source: Expense Categories
pl: Kategorie wydatków
th: หมวดหมู่รายจ่าย

source: New Category
pl: Nowa kategoria
th: หมวดหมู่ใหม่

source: New Income Category
pl: Nowa kategoria przychodu
th: หมวดหมู่รายรับใหม่

source: New Expense Category
pl: Nowa kategoria wydatku
th: หมวดหมู่รายจ่ายใหม่

source: Category Name
pl: Nazwa kategorii
th: ชื่อหมวดหมู่

source: Select Icon:
pl: Wybierz ikon:
th: เลือกไอคอน:

source: Category added
pl: Kategoria dodana
th: เพิ่มหมวดหมู่แล้ว

source: Create Categories
pl: Utwórz kategorie
th: สร้างหมวดหมู่

# noCategories
source: No categories yet
pl: Brak kategorii
th: ยังไม่มีหมวดหมู่

# longPressToFavorite
source: Long press to add/remove favorites
pl: Przytrzymaj, aby doda/usun z ulubionych
th: กดค้างเพื่อเพิ่ม/ลบรายการโปรด

# addedToFavorites
source: {name} added to favorites
pl: {name} dodano do ulubionych
th: เพิ่ม {name} ในรายการโปรดแล้ว

# removedFromFavorites
source: {name} removed from favorites
pl: {name} usunito z ulubionych
th: ลบ {name} ออกจากรายการโปรดแล้ว

source: Wallets
pl: Portfele
th: กระเป๋าเงิน

source: Add Wallet
pl: Dodaj portfel
th: เพิ่มกระเป๋าเงิน

source: Wallet Name
pl: Nazwa portfela
th: ชื่อกระเป๋าเงิน

source: Wallet Type
pl: Typ portfela
th: ประเภทกระเป๋าเงิน

source: Initial Balance
pl: Saldo pocztkowe
th: ยอดเริ่มต้น

source: Cash
pl: Gotówka
th: เงินสด

source: Bank
th: ธนาคาร

source: Credit Card
pl: Karta kredytowa
th: บัตรเครดิต

source: Savings
pl: Oszczdnoci
th: ออมทรัพย์

source: Wallet added
pl: Portfel dodany
th: เพิ่มกระเป๋าเงินแล้ว

# noWallets
source: No wallets yet
pl: Brak portfeli
th: ยังไม่มีกระเป๋าเงิน

source: Manage Wallets
pl: Zarzdzaj portfelami
th: จัดการกระเป๋าเงิน

# categoryNotFound
source: No category found
pl: Nie znaleziono kategorii
th: ไม่พบหมวดหมู่

# walletNotFound
source: No wallet found
pl: Nie znaleziono portfela
th: ไม่พบกระเป๋าเงิน

# errorWithDetails
source: Error: {details}
pl: Bd: {details}
th: ข้อผิดพลาด: {details}

# networkError
source: Network connection error. Please check your internet.
pl: Bd poczenia sieciowego. Sprawdź internet.
th: เกิดข้อผิดพลาดในการเชื่อมต่อ กรุณาตรวจสอบอินเทอร์เน็ต

source: Appearance
pl: Wygld
th: หน้าตา

source: Theme
pl: Motyw
th: ธีม

source: Language
pl: Jzyk
th: ภาษา

source: Dark
pl: Ciemny
th: มืด

source: Light
pl: Jasny
th: สว่าง

source: System
pl: Systemowy
th: ระบบ

source: Select Theme
pl: Wybierz motyw
th: เลือกธีม

source: Select Language
pl: Wybierz jzyk
th: เลือกภาษา

source: Color Scheme
pl: Schemat kolorów
th: โทนสี

source: Account
pl: Konto
th: บัญชี

source: Sign Out
pl: Wyloguj si
th: ออกจากระบบ

# signOutConfirm
source: Are you sure you want to sign out?
pl: Czy na pewno chcesz si wylogowa?
th: คุณแน่ใจหรือว่าต้องการออกจากระบบ?

source: User
pl: Użytkownik
th: ผู้ใช้

# login
source: Sign In
pl: Zaloguj si
th: เข้าสู่ระบบ

# register
source: Sign Up
pl: Zarejestruj si
th: ลงทะเบียน

source: Email
th: อีเมล

source: Password
pl: Haso
th: รหัสผ่าน

source: Full Name
pl: Imi i nazwisko
th: ชื่อ-นามสกุล

source: Forgot Password
pl: Zapomniae hasa
th: ลืมรหัสผ่าน

# noAccount
source: Don't have an account?
pl: Nie masz konta?
th: ยังไม่มีบัญชี?

# haveAccount
source: Already have an account?
pl: Masz już konto?
th: มีบัญชีแล้ว?

# loginSuccess
source: Login successful!
pl: Logowanie pomylne!
th: เข้าสู่ระบบสำเร็จ!

# registerSuccess
source: Registration successful! Please verify your email.
pl: Rejestracja pomylna! Potwierdź e-mail.
th: ลงทะเบียนสำเร็จ! กรุณายืนยันอีเมล

source: This Month
pl: Ten miesic
th: เดือนนี้

source: Last Month
pl: Poprzedni miesic
th: เดือนที่แล้ว

source: This Year
pl: Ten rok
th: ปีนี้

source: Monthly
pl: Miesicznie
th: รายเดือน

source: Weekly
pl: Tygodniowo
th: รายสัปดาห์

source: Daily
pl: Dziennie
th: รายวัน

source: Total Income
pl: czny przychód
th: รายรับรวม

source: Total Expense
pl: czne wydatki
th: รายจ่ายรวม

source: Balance
pl: Saldo
th: ยอดคงเหลือ

source: Category Breakdown
pl: Podzia kategorii
th: แยกตามหมวดหมู่

# cat_food
source: Food
pl: Jedzenie
th: อาหาร

# cat_transport
source: Transport
th: เดินทาง

# cat_shopping
source: Start Shopping
pl: Zakupy
th: ช้อปปิ้ง

# cat_entertainment
source: Entertainment
pl: Rozrywka
th: ความบันเทิง

# cat_bills
source: Bills
pl: Rachunki
th: บิล

# cat_health
source: Health
pl: Zdrowie
th: สุขภาพ

# cat_education
source: Education
pl: Edukacja
th: การศึกษา

# cat_rent
source: Rent
pl: Czynsz
th: ค่าเช่า

# cat_taxes
source: Taxes
pl: Podatki
th: ภาษี

# cat_salary
source: Salary
pl: Wynagrodzenie
th: เงินเดือน

# cat_freelance
source: Freelance
th: ฟรีแลนซ์

# cat_investment
source: Investment
pl: Inwestycje
th: การลงทุน

# cat_gift
source: Gift
pl: Prezent
th: ของขวัญ

# cat_other
source: Other
pl: Inne
th: อื่นๆ

# cat_pets
source: Pets
pl: Zwierzta
th: สัตว์เลี้ยง

# cat_groceries
source: Groceries
pl: Artykuy spożywcze
th: ของใช้

# cat_electronics
source: Electronics
pl: Elektronika
th: อิเล็กทรอนิกส์

# cat_charity
source: Charity
pl: Darowizny
th: บริจาค

# cat_insurance
source: Insurance
pl: Ubezpieczenie
th: ประกัน

# cat_gym
source: Gym
pl: Siownia
th: ฟิตเนส

# cat_travel
source: Travel
pl: Podróże
th: ท่องเที่ยว

# statisticsTitle
source: Statistics Overview
pl: Przegld statystyk
th: ภาพรวมสถิติ

# periodFilter
source: Period
pl: Okres
th: ช่วงเวลา

source: All Time
pl: Cay czas
th: ทั้งหมด

source: Last 7 Days
pl: Ostatnie 7 dni
th: 7 วันที่ผ่านมา

source: Last 30 Days
pl: Ostatnie 30 dni
th: 30 วันที่ผ่านมา

# averageDailySpending
source: Avg. Daily Spending
pl: r. dzienne wydatki
th: ค่าใช้จ่ายเฉลี่ย/วัน

source: Total Transactions
pl: czne transakcje
th: รายการทั้งหมด

source: Income Count
pl: Liczba przychodów
th: จำนวนรายรับ

source: Expense Count
pl: Liczba wydatków
th: จำนวนรายจ่าย

source: Top Categories
pl: Najważniejsze kategorie
th: หมวดหมู่ยอดนิยม

source: Savings Rate
pl: Stopa oszczdnoci
th: อัตราการออม

source: Biggest Income
pl: Najwikszy przychód
th: รายรับสูงสุด

source: Biggest Expense
pl: Najwikszy wydatek
th: รายจ่ายสูงสุด

# noData
source: No data for this period
pl: Brak danych dla tego okresu
th: ไม่มีข้อมูลสำหรับช่วงนี้

source: Spending Trend
pl: Trend wydatków
th: แนวโน้มการใช้จ่าย

source: Income vs Expense
pl: Przychód vs Wydatek
th: รายรับ vs รายจ่าย

# loginTab
source: Sign In
pl: Logowanie
th: เข้าสู่ระบบ

# registerTab
source: Sign Up
pl: Rejestracja
th: ลงทะเบียน

# tagline
source: Your financial freedom, in your hands
pl: Twoja wolno finansowa w Twoich rkach
th: อิสรภาพทางการเงิน อยู่ในมือคุณ

source: Enter full name
pl: Wprowadź imi i nazwisko
th: ป้อนชื่อ-นามสกุล

# nameTooShort
source: Name must be at least 2 characters
pl: Imi musi mie co najmniej 2 znaki
th: ชื่อต้องมีอย่างน้อย 2 ตัวอักษร

source: Enter email
pl: Wprowadź e-mail
th: ป้อนอีเมล

# validEmail
source: Enter a valid email
pl: Wprowadź prawidowy e-mail
th: ป้อนอีเมลที่ถูกต้อง

source: Enter password
pl: Wprowadź haso
th: ป้อนรหัสผ่าน

# passwordTooShort
source: Password must be at least 6 characters
pl: Haso musi mie co najmniej 6 znaków
th: รหัสผ่านต้องมีอย่างน้อย 6 ตัวอักษร

# forgotPasswordTitle
source: Reset Password
pl: Resetuj haso
th: รีเซ็ตรหัสผ่าน

# forgotPasswordText
source: We will send a password reset link to your email.
pl: Wylemy link do resetowania hasa na Twój e-mail.
th: เราจะส่งลิงก์รีเซ็ตรหัสผ่านไปยังอีเมลของคุณ

source: Send
pl: Wylij
th: ส่ง

# passwordResetSent
source: Password reset link sent.
pl: Link do resetowania hasa wysany.
th: ส่งลิงก์รีเซ็ตรหัสผ่านแล้ว

# loginFailed
source: Login failed. Check your email or password.
pl: Logowanie nie powiodo si. Sprawdź e-mail lub haso.
th: เข้าสู่ระบบล้มเหลว ตรวจสอบอีเมลหรือรหัสผ่าน

# registerFailed
source: Registration failed. Email may already be in use.
pl: Rejestracja nie powioda si. E-mail może by już używany.
th: ลงทะเบียนล้มเหลว อีเมลอาจถูกใช้แล้ว

# googleLoginFailed
source: Google sign-in failed
pl: Logowanie przez Google nie powiodo si
th: เข้าสู่ระบบด้วย Google ล้มเหลว

source: Continue with Google
pl: Kontynuuj przez Google
th: ดำเนินการต่อด้วย Google

# orDivider
source: or
pl: lub
th: หรือ

# privacyText
source: By continuing, you agree to our Terms of Service and Privacy Policy
pl: Kontynuujc, akceptujesz Warunki korzystania i Polityk prywatnoci
th: เมื่อดำเนินการต่อ คุณยอมรับข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัว

# errorOccurred
source: An error occurred
pl: Wystpi bd
th: เกิดข้อผิดพลาด

# welcomeTitle
source: Welcome to\nWallet Elite! ðŸ‘‹
pl: Witaj w\nPortfel Elita!
th: ยินดีต้อนรับสู่\nกระเป๋าเงิน อีลิท! 👋

# welcomeSubtitle
source: Just a few simple steps to start your journey to financial freedom.
pl: Kilka prostych kroków, aby rozpocz drog do wolnoci finansowej.
th: เพียงไม่กี่ขั้นตอนง่ายๆ เพื่อเริ่มต้นเส้นทางสู่อิสรภาพทางการเงิน

# manageWalletsDesc
source: Track all accounts in one place
pl: ledź wszystkie konta w jednym miejscu
th: ติดตามบัญชีทั้งหมดในที่เดียว

source: Analyze Spending
pl: Analizuj wydatki
th: วิเคราะห์การใช้จ่าย

# analyzeSpendingDesc
source: See where your money goes
pl: Zobacz, gdzie id Twoje pienidze
th: ดูว่าเงินของคุณไปที่ไหน

source: Debt Book
pl: Ksiga dugów
th: สมุดหนี้

# debtBookDesc
source: Track receivables and payables
pl: ledź należnoci i zobowizania
th: ติดตามลูกหนี้และเจ้าหนี้

# backButton
source: Back
pl: Wstecz
th: กลับ

# continueButton
source: Continue
pl: Kontynuuj
th: ดำเนินการต่อ

# startButton
source: Start
pl: Rozpocznij
th: เริ่มต้น

source: Select Currency
pl: Wybierz walut
th: เลือกสกุลเงิน

# selectCurrencyDesc
source: Select the currency you'll use in all accounts
pl: Wybierz walut, której bdziesz używa na wszystkich kontach
th: เลือกสกุลเงินที่คุณจะใช้ในทุกบัญชี

source: Turkish Lira
pl: Lira turecka
th: ลีราตุรกี

source: US Dollar
pl: Dolar amerykaski
th: ดอลลาร์สหรัฐ

source: Euro
th: ยูโร

source: British Pound
pl: Funt brytyjski
th: ปอนด์อังกฤษ

# createFirstWallet
source: Create Your First Wallet
pl: Utwórz pierwszy portfel
th: สร้างกระเป๋าเงินแรก

# createWalletDesc
source: Create a wallet to start tracking your money
pl: Utwórz portfel, aby ledzi swoje pienidze
th: สร้างกระเป๋าเงินเพื่อเริ่มติดตามเงินของคุณ

# walletNameHint
source: e.g. My Cash
pl: np. Moja gotówka
th: เช่น เงินสดของฉัน

# cashType
source: Cash
pl: Gotówka
th: เงินสด

source: Bank Account
pl: Konto bankowe
th: บัญชีธนาคาร

# creditCardType
source: Credit Card
pl: Karta kredytowa
th: บัตรเครดิต

# investmentType
source: Gold/Investment
pl: Zoto/Inwestycje
th: ทอง/การลงทุน

source: Initial Balance (Optional)
pl: Saldo pocztkowe (opcjonalnie)
th: ยอดเริ่มต้น (ไม่บังคับ)

# initialBalanceHint
source: Enter how much money you currently have. You can change it later.
pl: Wprowadź ile masz pienidzy. Możesz to później zmieni.
th: ป้อนจำนวนเงินที่คุณมีอยู่ ปรับเปลี่ยนได้ภายหลัง

# enterWalletName
source: Please enter wallet name
pl: Wprowadź nazw portfela
th: กรุณาป้อนชื่อกระเป๋าเงิน

# onboardingSuccess
source: Registration successful! You can now sign in.
pl: Rejestracja pomylna! Możesz si teraz zalogowa.
th: ลงทะเบียนสำเร็จ! คุณสามารถเข้าสู่ระบบได้แล้ว

source: Mon
pl: Pn
th: จ.

source: Tue
pl: Wt
th: อ.

source: Wed
pl: r
th: พ.

source: Thu
pl: Czw
th: พฤ.

source: Fri
pl: Pt
th: ศ.

source: Sat
pl: Sb
th: ส.

source: Sun
pl: Nd
th: อา.

source: Add Expense
pl: Dodaj wydatek
th: เพิ่มรายจ่าย

source: Add Income
pl: Dodaj przychód
th: เพิ่มรายรับ

source: Expense added
pl: Wydatek dodany
th: เพิ่มรายจ่ายแล้ว

source: Income added
pl: Przychód dodany
th: เพิ่มรายรับแล้ว

source: Debt Tracking
pl: ledzenie dugów
th: ติดตามหนี้

# myLends
source: Money Lent
pl: Pożyczyem
th: เงินที่ให้ยืม

# myDebts
source: Money Borrowed
pl: Pożyczyem od
th: เงินที่ยืม

source: Person Name
pl: Imi osoby
th: ชื่อบุคคล

source: Due Date
pl: Termin
th: วันครบกำหนด

source: Record Payment
pl: Zapisz patno
th: บันทึกการชำระ

# daysRemaining
source: {days} days left
pl: Pozostao {days} dni
th: เหลืออีก {days} วัน

source: Overdue
pl: Zalegy
th: เกินกำหนด

source: Remaining
pl: Pozostao
th: คงเหลือ

# lend
source: I Lent
pl: Pożyczyem
th: ฉันให้ยืม

# borrow
source: I Borrowed
pl: Pożyczyem od
th: ฉันยืม

source: Upcoming Dues
pl: Nadchodzce terminy
th: ใกล้ครบกำหนด

source: All Records
pl: Wszystkie wpisy
th: รายการทั้งหมด

source: Hide Completed
pl: Ukryj zakoczone
th: ซ่อนที่เสร็จแล้ว

source: Show Completed
pl: Pokaż zakoczone
th: แสดงที่เสร็จแล้ว

source: Mark as Completed
pl: Oznacz jako zakoczone
th: ทำเครื่องหมายว่าเสร็จ

# debtAdded
source: Record added
pl: Wpis dodany
th: เพิ่มบันทึกแล้ว

# debtUpdated
source: Record updated
pl: Wpis zaktualizowany
th: อัปเดตบันทึกแล้ว

# debtDeleted
source: Record deleted
pl: Wpis usunity
th: ลบบันทึกแล้ว

source: Payment recorded
pl: Patno zapisana
th: บันทึกการชำระแล้ว

# noDebts
source: No debt records yet
pl: Brak wpisów dugów
th: ยังไม่มีบันทึกหนี้

# addDebt
source: Add Record
pl: Dodaj wpis
th: เพิ่มบันทึก

# debtAmount
source: Amount
pl: Kwota
th: จำนวนเงิน

# debtDescription
source: Description (optional)
pl: Opis (opcjonalnie)
th: รายละเอียด (ไม่บังคับ)

source: Select due date
pl: Wybierz termin
th: เลือกวันครบกำหนด

source: Total Lent
pl: cznie pożyczone
th: ให้ยืมรวม

source: Total Borrowed
pl: cznie do oddania
th: ยืมรวม

# people
source: {count} people
pl: {count} osób
th: {count} คน

# memberSince
source: Member since {date}
pl: Czonek od {date}
th: สมาชิกตั้งแต่ {date}

source: Edit Profile
pl: Edytuj profil
th: แก้ไขโปรไฟล์

source: Profile updated
pl: Profil zaktualizowany
th: อัปเดตโปรไฟล์แล้ว

source: Change Photo
pl: Zmie zdjcie
th: เปลี่ยนรูปภาพ

source: Take Photo
pl: Zrób zdjcie
th: ถ่ายรูป

source: Choose from Gallery
pl: Wybierz z galerii
th: เลือกจากแกลเลอรี

source: Remove Photo
pl: Usu zdjcie
th: ลบรูปภาพ

source: Notifications
pl: Powiadomienia
th: การแจ้งเตือน

source: Quick Actions
pl: Szybkie akcje
th: การดำเนินการด่วน

source: This Month Summary
pl: Podsumowanie miesica
th: สรุปเดือนนี้

source: Financial Score
pl: Ocena finansowa
th: คะแนนการเงิน

# financialScoreDesc
source: Your financial health score
pl: Twoja ocena kondycji finansowej
th: คะแนนสุขภาพทางการเงินของคุณ

source: Spending Tips
pl: Porady dotyczce wydatków
th: เคล็ดลับการใช้จ่าย

# spendingTipsDesc
source: Savings suggestions
pl: Sugestie oszczdnoci
th: คำแนะนำการออม

source: Category Analysis
pl: Analiza kategorii
th: วิเคราะห์หมวดหมู่

# categoryAnalysisDesc
source: Detailed spending breakdown
pl: Szczegóowy podzia wydatków
th: รายละเอียดการใช้จ่าย

source: Monthly Comparison
pl: Porównanie miesiczne
th: เปรียบเทียบรายเดือน

# monthlyComparisonDesc
source: Compare with previous months
pl: Porównaj z poprzednimi miesicami
th: เปรียบเทียบกับเดือนก่อน

source: Budget Progress
pl: Postp budżetu
th: ความคืบหน้างบประมาณ

# budgetProgressDesc
source: How close to your goals
pl: Jak blisko celu
th: ใกล้เป้าหมายแค่ไหน

source: View Details
pl: Zobacz szczegóy
th: ดูรายละเอียด

source: Excellent
pl: Doskonale
th: ยอดเยี่ยม

source: Good
pl: Dobrze
th: ดี

source: Average
pl: rednio
th: ปานกลาง

source: Needs Improvement
pl: Wymaga poprawy
th: ต้องปรับปรุง

source: Poor
pl: Sabo
th: แย่

source: Compared to last month
pl: W porównaniu z poprzednim miesicem
th: เทียบกับเดือนที่แล้ว

source: you spent less
pl: wydae mniej
th: คุณใช้จ่ายน้อยลง

source: you spent more
pl: wydae wicej
th: คุณใช้จ่ายมากขึ้น

source: No change
pl: Bez zmian
th: ไม่เปลี่ยนแปลง

source: All Wallets
pl: Wszystkie portfele
th: กระเป๋าเงินทั้งหมด

source: Budgets
pl: Budżety
th: งบประมาณ

source: History
pl: Historia
th: ประวัติ

source: Sort
pl: Sortuj
th: เรียงลำดับ

source: Payment
pl: Patno
th: การชำระ

source: Completed Debts
pl: Zakoczone dugi
th: หนี้ที่เสร็จแล้ว

# noCompletedDebts
source: No completed debt records
pl: Brak zakoczonych dugów
th: ไม่มีหนี้ที่เสร็จแล้ว

source: Lent
pl: Pożyczone
th: ให้ยืม

source: Borrowed
pl: Od innych
th: ยืม

# deleteDebt
source: Delete Record
pl: Usu wpis
th: ลบบันทึก

# deleteDebtConfirm
source: Are you sure you want to delete this record? This action cannot be undone.
pl: Czy na pewno chcesz usun ten wpis? Tej operacji nie można cofn.
th: คุณแน่ใจหรือว่าต้องการลบบันทึกนี้? ไม่สามารถเลิกทำได้

source: Payment History
pl: Historia patnoci
th: ประวัติการชำระ

source: No payments yet
pl: Brak patnoci
th: ยังไม่มีการชำระ

source: Display Name
pl: Wywietlana nazwa
th: ชื่อที่แสดง

# customDateRange
source: Custom Range
pl: Wasny zakres
th: กำหนดเอง

source: Start Date
pl: Data pocztkowa
th: วันที่เริ่มต้น

source: End Date
pl: Data kocowa
th: วันที่สิ้นสุด

source: Select Date Range
pl: Wybierz zakres dat
th: เลือกช่วงวันที่

source: Transaction Summary
pl: Podsumowanie transakcji
th: สรุปรายการ

# topSpendingCategory
source: Top Spending
pl: Najwiksze wydatki
th: ใช้จ่ายมากสุด

# leastSpendingCategory
source: Least Spending
pl: Najmniejsze wydatki
th: ใช้จ่ายน้อยสุด

# averageTransaction
source: Avg. Transaction
pl: r. transakcja
th: รายการเฉลี่ย

source: Weekday Spending
pl: Wydatki w dni robocze
th: ใช้จ่ายวันธรรมดา

source: Weekend Spending
pl: Wydatki weekendowe
th: ใช้จ่ายวันหยุด

source: vs Last Month
pl: vs poprzedni miesic
th: เทียบกับเดือนที่แล้ว

source: This Week
pl: Ten tydzie
th: สัปดาห์นี้

source: Last Week
pl: Zeszy tydzie
th: สัปดาห์ที่แล้ว

source: Last 3 Months
pl: Ostatnie 3 miesice
th: 3 เดือนที่ผ่านมา

source: Last 6 Months
pl: Ostatnie 6 miesicy
th: 6 เดือนที่ผ่านมา

source: View All Categories
pl: Zobacz wszystkie kategorie
th: ดูหมวดหมู่ทั้งหมด

source: View Trend Details
pl: Zobacz szczegóy trendu
th: ดูรายละเอียดแนวโน้ม

source: Budget Tips
pl: Porady budżetowe
th: เคล็ดลับงบประมาณ

source: Savings Goal
pl: Cel oszczdnoci
th: เป้าหมายการออม

source: Potential Savings
pl: Potencjalne oszczdnoci
th: การออมที่เป็นไปได้

# ifYouReduce
source: If you reduce {category} by {percent}%, you could save {amount} monthly
pl: Jeli zmniejszysz {category} o {percent}%, możesz zaoszczdzi {amount} miesicznie
th: หากคุณลด {category} ลง {percent}% คุณสามารถประหยัดได้ {amount} ต่อเดือน

source: All Categories
pl: Wszystkie kategorie
th: หมวดหมู่ทั้งหมด

source: Category Details
pl: Szczegóy kategorii
th: รายละเอียดหมวดหมู่

source: Trend Details
pl: Szczegóy trendu
th: รายละเอียดแนวโน้ม

source: Period Comparison
pl: Porównanie okresów
th: เปรียบเทียบช่วงเวลา

source: No expense data
pl: Brak danych o wydatkach
th: ไม่มีข้อมูลรายจ่าย

source: Spending Patterns
pl: Wzorce wydatków
th: รูปแบบการใช้จ่าย

source: Apply
pl: Zastosuj
th: ใช้งาน

source: Reset
pl: Resetuj
th: รีเซ็ต
